{
  "app": {
    "name": "Zignatures",
    "short_description": "Zignature app enhances Agents control over signatures",
    "long_description": "Zignatures is ticket sidebar/new ticket sidebar app which solves very old product limitation around Agent signatures.\nOut of the box Zendesk signatures are very limited in terms of localization, customization and advanced logic.\nZignatures solves all these limitations allowing Admins to create intelligent signatures with any type of look and feel, \nenabling Agents to see and control signatures behavior and ultimately make it possible for Marketing people to use this space more effectively.\nZignatures app solves real problem reported by customers like Dorchester or Radio Holland.\nZignatures app is completed and ready to be shipped, it is translated in several languages and uses latest Zendesk technologies like ZAF v2 and Zendesk gardens.",
    "installation_instructions": "Install the app.\nConfigure settings.\nEnjoy!",
    "parameters": {
      "signature_template": {
        "label": "Text or HTML of a signature",
        "helpText": "Copy here the entire text or HTML which be be used for Agent signatures. Standard Zendesk placeholders and dynamic content is allowed."
      },
      "show_app_to_agents": {
        "label": "Show app to agents",
        "helpText": "If selected Agents will be able to see this app on the right hand side. App informs agents whether ticket will be signed or not."
      },
      "sign_private_comment": {
        "label": "Sign private comments",
        "helpText": "If selected the app will sign private comments. Otherwise, private comments will be ignored."
      },
      "agents_can_decide_on_comment_signatures": {
        "label": "Agents can decided on particular comment signature",
        "helpText": "If selected Agent will be able to see an option not to sign a particular comment"
      },
      "agents_can_decide_on_ticket_signatures": {
        "label": "Agents can decided on all comments signature",
        "helpText": "If selected Agent will be able to see an option not to sign all comments particular comment"
      }
    }
  }
}
